using System;

namespace FirstParseTelegramBot
{
    class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("Hello World!");
        }
    }
}


//Выбрать другой сайт и сделать это для другого сайта.


//https://smil.ua/catalog/school/page/1


//Мне нужен список товаров в файле xlsx


//ид, название, цена, ссылка на сайте, ссылка на картинку, новое или нет.


//1. Как подключать библиотеки и какие из них нам понадобятся.
//2. Как получить содержание веб страницы.
//3. Как найти на странице данные.
//4. Как сохранить данные в XLSX.
//5. Основы работы с телеграм ботом.